sjaramillo-yx/YX_Camera/camara_vuelta/sdkconfig.defaults
##################################################
## PROJECT CONFIGURATION
#
CONFIG_IDF_TARGET="esp32p4"
CONFIG_IDF_TARGET_ESP32P4=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y

##################################################
## PSRAM
#
CONFIG_SPIRAM=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_SPEED_200M=y

##################################################
## FLASH CONFIGURATION
#
CONFIG_SPI_FLASH_SUPPORT_GD_CHIP=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

##################################################
## MQTT
#
CONFIG_MQTT_SKIP_PUBLISH_IF_DISCONNECTED=y
CONFIG_MQTT_USE_CUSTOM_CONFIG=y
CONFIG_MQTT_TASK_STACK_SIZE=8192

##################################################
## LOGGING
#
CONFIG_LOG_VERSION_2=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y

##################################################
## CAMERA SENSOR
#
CONFIG_CAMERA_OV5647=y
CONFIG_CAMERA_OV5647_MIPI_IF_FORMAT_INDEX_DEFAULT=4
CONFIG_CAMERA_OV5647_MIPI_RAW10_1280X960_BINNING_45FPS=y

##################################################
## FULL FATFS SCAN
#
CONFIG_FATFS_DONT_TRUST_FREE_CLUSTER_CNT=1
CONFIG_FATFS_DONT_TRUST_LAST_ALLOC=1

##################################################
## ETHERNET
#
CONFIG_ETH_IRAM_OPTIMIZATION=y

CONFIG_ETH_ENABLED=y
CONFIG_ETH_USE_ESP32_EMAC=y
CONFIG_ETH_PHY_INTERFACE_RMII=y
CONFIG_ETH_DMA_RX_BUFFER_NUM=20
CONFIG_ETH_DMA_TX_BUFFER_NUM=20
CONFIG_ETH_DMA_BUFFER_SIZE=1024

##################################################
## NETWORK SPEED TWEAKS
#
CONFIG_MBEDTLS_ASYMMETRIC_CONTENT_LEN=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=16384
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65535
CONFIG_LWIP_TCP_WND_DEFAULT=65535
CONFIG_LWIP_TCP_MSS=1460
CONFIG_LWIP_IRAM_OPTIMIZATION=y
CONFIG_MBEDTLS_HARDWARE_AES=y
CONFIG_MBEDTLS_HARDWARE_SHA=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_LWIP_WND_SCALE=y
CONFIG_LWIP_TCP_RCV_SCALE=1